label good_end:

    show bg vr room
    with flashbulb_long

    show oleg

    oleg "Процедура финального тестирования завершена. Количество багов стремится к нулю. Критические отсутствуют. Результат соответствует критериям успешного завершения проекта"

    kirill "Фух... {w=0.5} Получилось. Я всё проверил."

    oleg "На основании продемонстрированной компетенции и исключительных показателей эффективности, я хочу предложить позицию ведущего специалиста по тестированию."

    kirill "Ведущий специалист? Это... {w=1.0} даже лучше, чем я рассчитывал."

    oleg "Ваши аналитические способности представляют высокую ценность для компании. Финансовое вознаграждение будет соответствовать новому статусу. Поздравляю с успешным карьерным стартом."

label medium_end:

    show bg vr room
    with flashbulb_long

    show oleg

    oleg "Работа над проектом завершена досрочно. Уровень дефектов превышает допустимый порог. Показатель эффективности не соответствует минимальным требованиям для продолжения сотрудничества."

    kirill "Я... Я же исправлял самые важные баги! Остальное — мелочи!"

    oleg "Увы. Мы не можем доверить проекты человеку с таким уровнем подготовки"

    kirill "Дайте еще один шанс! Я сейчас всё исправлю!"

    oleg "Решение окончательно."

label bad_end:

    show bg vr room
    with flashbulb_long

    show oleg

    system "ПРЕДУПРЕЖДЕНИЕ! ЦЕЛОСТНОСТЬ... ПОД ВОПРОСОМ! КОЛИЧЕСТВО... ОШИБОК... ПРЕВЫСИЛО... ДОПУСТИМЫЕ... ЛИМИТЫ!"

    kirill "Олег! Немедленно останови симуляцию! Выведи меня!"

    system "СВЯЗЬ... С БАЗОЙ... ПОТЕРЯНА... ОТКЛЮЧЕНИЕ... НЕВОЗМОЖНО..."

    kirill "Олег! Отзовись! Кто-нибудь!"
