label iter2:

    oleg_matrix "Финальный босс побежден. Начинаю перезагрузку симуляции. Поздравляю с успешным завершением второго цикла."

    oleg_matrix "Ручное тестирование демонстрирует низкую эффективность при многократных повторениях. Я открою тебе доступ к инструменту, с которым ты сможешь писать тест-кейсы"

    kirill "Тест-кейсы? А что это?"

    oleg_matrix "С помощью кода ты сможешь проверять определенные ситуации на наличие багов"

    kirill "Ну вроде понял. Я готов идти дальше"

    oleg_matrix "Отлично, я перезапускаю матрицу"

    jump cycle

